// Найти сумму чисел от 1 до А
Console.Write("Введите число: ");
int A = int.Parse(Console.ReadLine());
Console.WriteLine(((1 + A)*A)/2);
